Процедура ЗаполнитьИнвентаризациюПоОстаткам(Инвентаризация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоПоУчету
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура";
	Запрос.УстановитьПараметр("Дата", 	Инвентаризация.Дата);
	Запрос.УстановитьПараметр("Склад", 	Инвентаризация.Склад);
	
	Инвентаризация.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
