
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
	Измерение = Планировщик.Измерения.Добавить("Сотрудник");
	Выборка = Справочники.СотрудникиПриема.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
	ЗначениеИзмерения = Измерение.Элементы.Добавить(Выборка.Ссылка);
	ЗначениеИзмерения.Текст = Выборка.Наименование;
	ЗначениеИзмерения.ЦветРамки =  WebЦвета.ЗеленаяЛужайка;
КонецЦикла;
ОбновитьПериодОтображенияПланировщика();  
КонецПроцедуры 


	&НаСервере
Процедура ОбновитьПериодОтображенияПланировщика()
	Начало = НачалоДня(Дата) + 9*3600;
	Конец = НачалоДня(Дата) +19*3600;
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(Начало,Конец);
КонецПроцедуры

